Функция МетаданныеДокументаВJSON(МетаДок) Экспорт
	ИмяФайла = МетаДок.ПолноеИмя() + ".json";
	
	Json = ПолучитьJson(МетаДок);
	
	// Сохранение в файл
	ДиалогСохранения = Новый ДиалогСохранения;
	ДиалогСохранения.Фильтр = "JSON файлы (*.json)|*.json";
	ДиалогСохранения.ПолноеИмяФайла = ИмяФайла;
	
	Если ДиалогСохранения.Выбрать() Тогда
		ПутьФайла = ДиалогСохранения.ПолноеИмяФайла;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Json);
	ТекстовыйДокумент.Записать(ПутьФайла, "UTF-8");
    
	Возврат Истина;
КонецФункции

Функция ПолучитьJson(МетаДок) Экспорт

	Результат = Новый Структура;
    Результат.Вставить("document", МетаДок.Имя);
    Результат.Вставить("description", "Описание документа: "+МетаДок.Синоним+" ("+МетаДок.Имя+")");
    // ---------- реквизиты документа ----------
    МассивРеквизитов = Новый Массив;

    Для Каждого Рекв Из МетаДок.Реквизиты Цикл

        Стр = Новый Структура;
        Стр.Вставить("name", Рекв.Имя);
        Стр.Вставить("type", ПолучитьИмяТипа(Рекв.Тип));
		
		Если ПолучитьИмяТипа(Рекв.Тип)="Число" Тогда
	        Если Рекв.Тип.КвалификаторыЧисла.Разрядность > 0 Тогда
	            Стр.Вставить("length", Рекв.Тип.КвалификаторыЧисла.Разрядность);
	        КонецЕсли;

	        Если Рекв.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0 Тогда
	            Стр.Вставить("precision", Рекв.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
			КонецЕсли;      
		КонецЕсли;

        МассивРеквизитов.Добавить(Стр);

    КонецЦикла;

    Результат.Вставить("fields", МассивРеквизитов);

    // ---------- табличные части ----------      
	Попытка
    МассивТЧ = Новый Массив;

    Для Каждого ТЧ Из МетаДок.ТабличныеЧасти Цикл

        СтрТЧ = Новый Структура;
        СтрТЧ.Вставить("name", ТЧ.Имя);

        Поля = Новый Массив;

        Для Каждого Поле Из ТЧ.Реквизиты Цикл

            СтрПоле = Новый Структура;
            СтрПоле.Вставить("name", Поле.Имя);
            СтрПоле.Вставить("type", ПолучитьИмяТипа(Поле.Тип));
			
			Если ПолучитьИмяТипа(Поле.Тип)="Число" Тогда

	            Если Поле.Тип.КвалификаторыЧисла.Разрядность > 0 Тогда
	                СтрПоле.Вставить("length", Поле.Тип.КвалификаторыЧисла.Разрядность);
	            КонецЕсли;

	            Если Поле.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0 Тогда
	                СтрПоле.Вставить("precision", Поле.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти);
				КонецЕсли;    
			КонецЕсли;

            Поля.Добавить(СтрПоле);

        КонецЦикла;

        СтрТЧ.Вставить("fields", Поля);
        МассивТЧ.Добавить(СтрТЧ);

    КонецЦикла;

    Результат.Вставить("tableParts", МассивТЧ);   
	Исключение
    КонецПопытки;
    // ---------- сериализация ----------
    JSON = СоздатьJSON(Результат);

	Возврат JSON;
КонецФункции

Функция СоздатьJSON(Данные)

    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();

    ЗаписатьJSON(ЗаписьJSON, Данные);

    Возврат ЗаписьJSON.Закрыть();

КонецФункции         

Функция ПолучитьИмяТипа(ОписаниеТипа)

    ИменаТипов = ""; // Создаем строку для хранения имен типов
    Для Каждого Тип Из ОписаниеТипа.Типы() Цикл
        
        // тип значения
        ТипЗначения = Метаданные.НайтиПоТипу(Тип);
        
        // имя метаданных
        Если ТипЗначения <> Неопределено Тогда
            ИменаТипов = ИменаТипов + ТипЗначения.ПолноеИмя() + ", "; // Добавляем имя типа
        КонецЕсли;

    КонецЦикла;

    Если ИменаТипов <> "" Тогда
        ИменаТипов = Лев(ИменаТипов, СтрДлина(ИменаТипов) - 2); // Удаляем последнюю запятую и пробел
		Возврат ИменаТипов; // Возвращаем строку с именами типов
	КонецЕсли;

    Возврат Строка(ОписаниеТипа); // Если не удалось найти имена типов, возвращаем строковое представление типа

КонецФункции
